bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
/*
      Tiny Robot Code, v0.2
      by Bill Weiler

      Segger Embedded Studio - full version is free for Nordic chips, using ARM M version v3.34
      Nordic nRF5 SDK v14.2
      Nordic SDK BLE_Peripheral_Template example used as starting point 
      CMSIS DSP Library
      Nordic chip: nRF52832 QFN48 AA
      nRF52832 runs at 64Mhz, has 512k flash and 64k SRAM, and hardware single precision floating point
      Nordic BLE Stack called Softdevice, is S132 v5.0.0, linked a hex file

      Targets for this code are Tiny Robot and Sparkfun nRF52832 reference design
      Tiny Robot has these features:
      1. VLX6180 distance sensor through i2c
      2. 2 motors, left and right, driven through 2 TI DRV8834 driven by uC gpio's, plus the PWM0 peripheral for stepping
      3. Microphone through PDM peripheral
      4. Buzzer through PWM1 peripheral
      5. 1 LED through gpio, active low (clearing it (0) turns led on)
      6. BLE antenna, s132 supports central and peripheral, observer and broadcaster, total 20 connections (that's 19 robots and a cellphone!)

      There is no crystal LF oscillator in Tiny Robot, the softdevice uses the internal RC oscillator, there is a 32Mhz crystal HF oscillator for CPU

      GCC is not always smart enough, use idioms or intrinsics for floating point, or just check disassembly to make sure FPU instructions were generated.

      Watch out modifying code, the BLE stack takes peripherals and scheduling. Notably it takes Timer0, some flash and ram, and a lot of cpu cycles. If you
      have problems, use their API for scheduling time slots. Check the Softdevice documentation for blocked peripherals.

      Read this stuff:
      1. nRF52832 datasheet, watch out for old versions, like on Sparkfun, I am using v1.4
      2. Softdevice Specification
      3. Errata
      4. Softdevice API - online only
      5. Nordic devzone forums
      6. Compatability list (really boring but useful)
      7. VLX6180 datasheet
      8. Microphone - stuff about PDM and PCM, can play raw audio you grab out of IDE in Audacity (free download)
*/
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include "sdk_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "app_timer.h"
#include "fds.h"
#include "peer_manager.h"
#include "ble_conn_state.h"
#include "nrf_ble_gatt.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "arm_const_structs.h"
#include "nrf_drv_twi.h"
#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "nrf_pwm.h"
#include "nrf_timer.h"
#include "vl6180.h"
#include "nrf_drv_pdm.h"

//COMMAND SET FOR BLE
#define MOTORS_RIGHT      0x10
#define MOTORS_LEFT       0x11
#define MOTORS_FORWARD    0x12
#define MOTORS_BACKWARD   0x13
#define MOTORS_STOP       0x14
#define MOTORS_SLEEP      0x15
#define STEPPING_TEST     0x16

#define GET_DISTANCE      0x22
#define GET_AMBIENT       0x21

#define RECORD_SOUND      0x30
#define INCREASE_GAIN     0x31
#define DECREASE_GAIN     0x32
/*
    Conditional compilation
    ========================================================
    CB_TEST 1 = companion board tester code
    MB_TEST 1 = mainboard (or frontboard FB) tester
    SPARKFUN 1 = Sparkfun reference code
    SPARTFUN 0 = Tiny Robot firmware
*/
#define CB_TEST 0
#define MB_TEST 0
#define MICROPHONE 0
#define SPARKFUN 0
#if CB_TEST
#define SPARKFUN 0
#endif
#if MB_TEST
#define SPARKFUN 0
#endif

#if SPARKFUN

#define UART_RX_PIN   26
#define UART_TX_PIN   27

#define BUZZER_10MM   31

//VLX6180
//SHDN
#define GP0       24
//GPIO
#define GP1       23
#define I2C0_SCL  22
#define I2C0_SDA  20

//microphone
#define MIC_CLK   16
#define MIC_DI    17
#define MIC_SEL   18

//motors
#define M1        3
#define M0        12
#define DIR_L     2
#define STEP      1
#define DIR_R     4

//actually red
#define GREEN_LED 7

#else

#define UART_RX_PIN   12
#define UART_TX_PIN   11

//Buzzer
#define BUZZER_10MM   8

//microphone
#define MIC_CLK   28
#define MIC_DI    29

//VLX6180
#define GP0       14
#define GP1       13
#define I2C0_SCL  15
#define I2C0_SDA  16

//motors
#define M1        25
#define M0        23
#define DIR_L     22
#define STEP      30
#define SLEEP     27
#if CB_TEST
#define DIR_R     24
#define GREEN_LED 7
#else
#define DIR_R     26
#define GREEN_LED 2
#endif
#endif

//BLE defines, refactored from SDK
#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2    /**< Reply when unsupported features are requested. */

#define DEVICE_NAME                     "Skoobot"                               /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME               "William Weiler Eng"                    /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_BLE_OBSERVER_PRIO           3                                       /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_BLE_CONN_CFG_TAG            1                                       /**< A tag identifying the SoftDevice BLE configuration. */

#define APP_ADV_INTERVAL                64                                      /**< The advertising interval (in units of 0.625 ms; this value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED   /**< The advertising time-out (in units of seconds). When set to 0, we will never time out. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(100, UNIT_1_25_MS)        /**< Minimum acceptable connection interval (0.5 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(200, UNIT_1_25_MS)        /**< Maximum acceptable connection interval (1 second). */
#define SLAVE_LATENCY                   0                                       /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)         /**< Connection supervisory time-out (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(20000)                  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (15 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000)                   /**< Time between each call to sd_ble_gap_conn_param_update after the first call (5 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define BUTTON_DETECTION_DELAY          APP_TIMER_TICKS(50)                     /**< Delay from a GPIOTE event until a button is reported as pushed (in number of timer ticks). */

#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

