bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
    #if MICROPHONE
    //like 6700 samples in p_rx_buffer
    m_xfer_done = false;
    nrf_drv_pdm_buffer_set(p_rx_buffer, SAMPLE_BUFFER_CNT);
    nrf_drv_pdm_start();
    while(m_xfer_done == false);
    nrf_drv_pdm_stop();
    do_dft();            //do fft, then check m_fft_output_f32 64 bytes
    #endif

    new_cmd = 0;
  
    for (;;)
    {
          //Trap here when BLE not connected
          while (BLE_Connected == 0)
          {
            stop_buzzer();
            stop_stepping();
            motors_sleep();
            nrf_delay_ms(200);
          }
          if (new_cmd == 1)
          {
            switch(cmd_value)
            {
            case MOTORS_RIGHT:
              motors_right();           //go right 90 degrees
              pwm_motor_stepping(50);
              motors_wake();
              nrf_delay_ms(500);        //this should be 5 steps each motor for 90 degree turn
              stop_stepping();          //if it doesn't work I'll try doing 5 steps manually
              motors_sleep();
              break;
            case MOTORS_LEFT:
              motors_left();
              pwm_motor_stepping(50);
              motors_wake();
              nrf_delay_ms(500);        //this should be 5 steps each motor for 90 degree turn
              stop_stepping();          //if it doesn't work I'll try doing 5 steps manually
              motors_sleep();
              break;
            case MOTORS_FORWARD:
              motors_forward(100);
              pwm_motor_stepping(50);
              motors_wake();
              nrf_delay_ms(500);        //this should be 5 steps each motor for 90 degree turn
              stop_stepping();          //if it doesn't work I'll try doing 5 steps manually
              motors_sleep();
              break;
            case MOTORS_BACKWARD:
              motors_backward();
              pwm_motor_stepping(50);
              motors_wake();
              nrf_delay_ms(500);        //this should be 5 steps each motor for 90 degree turn
              stop_stepping();          //if it doesn't work I'll try doing 5 steps manually
              motors_sleep();
              break;
            case MOTORS_STOP:
              stop_stepping();
              nrf_delay_ms(1000);     
              break;
            case MOTORS_SLEEP:
              motors_sleep();
              nrf_delay_ms(1000);       
              break;
            case STEPPING_TEST:
              step_mode_experiment();
              break;
            case GET_DISTANCE:
              range = getDistance();
              break;
            case GET_AMBIENT:
              break;
            case RECORD_SOUND:
              m_xfer_done = false;
              nrf_drv_pdm_buffer_set(p_rx_buffer, SAMPLE_BUFFER_CNT);
              nrf_drv_pdm_start();
              while(m_xfer_done == false);
              nrf_drv_pdm_stop();
              do_dft(); 
              break;
            case INCREASE_GAIN:
              break;
            case DECREASE_GAIN:
              break;
           default:
               break;
          }
          new_cmd = 0;
      }
      else
      {
        pwm_buzzer_frequency(2000.0);
        led_on();
        motors_forward(100);      //go forward
        motors_wake();
        nrf_delay_ms(2000);
        led_off();
        stop_stepping();          
        motors_sleep();
        stop_buzzer();
        motors_right();           //go right 90 degrees
        pwm_motor_stepping(50);
        motors_wake();
        nrf_delay_ms(500);        //this should be 5 steps each motor for 90 degree turn
        stop_stepping();          //if it doesn't work I'll try doing 5 steps manually
        motors_sleep();
      }
   }  
}

void turn_left_90_degrees(void)
{
  motors_left();            //turn left
  pwm_motor_stepping(50);   
  nrf_delay_ms(100);        //this should be 5 steps each motor for 90 degree turn
  stop_stepping();          //if it doesn't work I'll try doing 5 steps manually
}

//Left channel configured by default
void configure_microphone(void)
{

  nrf_drv_pdm_config_t pdm_config = NRF_DRV_PDM_DEFAULT_CONFIG(MIC_CLK,MIC_DI);

  pdm_config.clock_freq = NRF_PDM_FREQ_1032K;
  pdm_config.mode = NRF_PDM_MODE_MONO;
  pdm_config.edge = NRF_PDM_EDGE_LEFTRISING;
  pdm_config.gain_l = NRF_PDM_GAIN_DEFAULT;
  pdm_config.gain_r = NRF_PDM_GAIN_DEFAULT;

  nrf_drv_pdm_init(&pdm_config, audio_handler);
 
  return; 
}

void step_mode_experiment(void)
{
    uint8_t stepmode, cnt_of_trys;

    motors_sleep();
    stepmode = 0;
    for (cnt_of_trys=0;(cnt_of_trys<5);cnt_of_trys++)
    {
        stepping_mode(stepmode);
        switch(stepmode)
        {
          case 0:
            motors_forward(40);     //whole step
            led_on();               //mark start of test
            break;
          case 1:
            motors_forward(80);     //1/2 step
            led_off();
            break;
          case 2:
            motors_forward(160);    //1/4 step
            break;
          case 3:
            motors_forward(320);    //1/8 step
            break;
          case 4:
            motors_forward(640);    //1/16 step
            break;
          case 5:
            motors_forward(1280);   //1/32 step
            break;
        }
        ++stepmode;
        if (stepmode == 6)
            stepmode = 0;
        motors_wake();
        nrf_delay_ms(2000);
        stop_stepping();
        motors_sleep();
        nrf_delay_ms(500);
    }
    return;
}

inline void led_off(void)
{
    nrf_gpio_pin_set(GREEN_LED);
}

inline void led_on(void)
{
    nrf_gpio_pin_clear(GREEN_LED);
}

inline void motors_sleep(void)
{
    nrf_gpio_pin_clear(SLEEP);
}

inline void motors_wake(void)
{
    nrf_gpio_pin_set(SLEEP);
}

void motors_forward_with_timer(uint32_t freq, uint32_t ms)
{
  nrf_gpio_pin_set(DIR_R);
  nrf_gpio_pin_clear(DIR_L);
  timer1_counter = 0;
  timer1_match_value = 125000 / ms;
  timer1_enabled_for_motors = 1;
  pwm_motor_stepping(freq);
  NRF_TIMER1->TASKS_START = 1;
}

void motors_forward(uint32_t freq)
{
  nrf_gpio_pin_set(DIR_R);
  nrf_gpio_pin_clear(DIR_L);
  pwm_motor_stepping(freq);    
}

