bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
void motors_backward(void)
{
   nrf_gpio_pin_set(DIR_L);
   nrf_gpio_pin_clear(DIR_R);
}

void motors_right(void)
{
   nrf_gpio_pin_clear(DIR_L);
   nrf_gpio_pin_clear(DIR_R);
}

void motors_left(void)
{
   nrf_gpio_pin_set(DIR_L);
   nrf_gpio_pin_set(DIR_R);
}

void stepping_mode(uint8_t mode)
{
    switch(mode)
    {
        case 0:     //full step
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_clear(M0);
          nrf_gpio_pin_clear(M1);
          break;
        case 1:     //1/2 step
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_set(M0);
          nrf_gpio_pin_clear(M1);
          break;
        case 2:     //1/4 step
          nrf_gpio_cfg_input(M0,NRF_GPIO_PIN_NOPULL);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_clear(M1);
          break;
        case 3:     //8 microsteps
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_clear(M0);
          nrf_gpio_pin_set(M1);
          break;
       case 4:     //16 microsteps
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_set(M0);
          nrf_gpio_pin_set(M1);
          break;
       case 5:     //32 microsteps
          nrf_gpio_cfg_input(M0,NRF_GPIO_PIN_NOPULL);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_set(M1);
          break;
      default:      //full step
          nrf_gpio_cfg_output(M0);
          nrf_gpio_cfg_output(M1);
          nrf_gpio_pin_clear(M0);
          nrf_gpio_pin_clear(M1);
          break;
    }
}

void configure_VLX6180(void)
{
    twi_init();
    VLX6180_init();
}

void VLX6180_init(void)
{
    nrf_gpio_cfg_output(GP0);   //power up is chip enable
    nrf_gpio_pin_set(GP0);
    nrf_gpio_cfg_input(GP1,NRF_GPIO_PIN_NOPULL);    //open drain interrupt
  
    VL6180xInit();
    VL6180xDefautSettings();
}

__STATIC_INLINE void data_handler(uint8_t temp)
{

}

//TIMER1 - this is the motor timer
void TIMER1_IRQHandler(void)
{
  if (timer1_enabled_for_motors == 1)
  {
    ++timer1_counter;
    if (timer1_counter == timer1_match_value)
    {
      NRF_TIMER1->TASKS_STOP = 1;     //do this first so you don't pop in here again while doing this
      stop_stepping();
      timer1_enabled_for_motors = 0;  //this is redundant, but maybe useful later
    }
  }
}

void twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
    switch (p_event->type)
    {
        case NRF_DRV_TWI_EVT_DONE:
            if (p_event->xfer_desc.type == NRF_DRV_TWI_XFER_RX)
            {
                //data_handler(m_sample);
            }
            break;
        default:
            break;
    }
}

void twi_init(void)
{
    ret_code_t err_code;

    const nrf_drv_twi_config_t twi_VLX6180_config = {
       .scl                = I2C0_SCL,
       .sda                = I2C0_SDA,
       .frequency          = NRF_TWI_FREQ_100K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    err_code = nrf_drv_twi_init(&m_twi, &twi_VLX6180_config, NULL, NULL);

    nrf_drv_twi_enable(&m_twi);
}


void audio_handler(nrf_drv_pdm_evt_t const * const evt)
{
   if (evt->buffer_requested == false)
       m_xfer_done = true;
}

void pwm_motor_stepping(uint32_t steps_per_second)
{

  volatile static uint32_t pwm_duty[2], cnt_128k;

  cnt_128k = 128000 / steps_per_second;  
  pwm_duty[0] = pwm_duty[1] = cnt_128k / 2;

  NRF_PWM0->COUNTERTOP = cnt_128k; 
  NRF_PWM0->SEQ[0].PTR = pwm_duty;
  NRF_PWM0->SEQ[0].CNT = 1;
  NRF_PWM0->TASKS_SEQSTART[0] = 1;   
}

//125000/freq=    125000/250
void pwm_buzzer_frequency(float freq)
{
  float main_freq;
  volatile static uint16_t pwm_top, pwm_duty[2];
   
  main_freq = 125000.0 / freq;

  pwm_top = (uint16_t)main_freq;
  pwm_duty[0] = pwm_duty[1] = (uint16_t)(main_freq / 2.0);

  NRF_PWM1->COUNTERTOP = pwm_top; //1 msec
  NRF_PWM1->SEQ[0].PTR = (uint32_t)(pwm_duty);
  NRF_PWM1->SEQ[0].CNT = 1;
  NRF_PWM1->TASKS_SEQSTART[0] = 1;   
}

void cb_test(void)
{
  my_configure();

  for(;;)
  {
    led_on();
    motors_forward(100);
    wake_motors();
    nrf_delay_ms(2000);
    stop_motors();
    sleep_motors();
    led_off();
    nrf_delay_ms(2000);
  }

}

void mb_test(void)
{
  static uint8_t range, buf[64];

  nrf_gpio_cfg_output(MIC_CLK);
  nrf_gpio_cfg_output(MIC_DI);
  nrf_gpio_cfg_output(SLEEP);
  
  for(;;)
  {
    led_on();
    nrf_gpio_pin_clear(STEP);
    nrf_gpio_pin_clear(DIR_L);
    nrf_gpio_pin_clear(DIR_R);
    nrf_gpio_pin_clear(M1);
    nrf_gpio_pin_clear(M0);
    nrf_gpio_pin_clear(MIC_CLK);
    nrf_gpio_pin_clear(MIC_DI);
    nrf_gpio_pin_clear(SLEEP);
    nrf_delay_ms(500);
    led_off();
    nrf_gpio_pin_set(STEP);
    nrf_gpio_pin_set(DIR_L);
    nrf_gpio_pin_set(DIR_R);
    nrf_gpio_pin_set(M1);
    nrf_gpio_pin_set(M0);
    nrf_gpio_pin_set(MIC_CLK);
    nrf_gpio_pin_set(MIC_DI);
    nrf_gpio_pin_set(SLEEP);
    nrf_delay_ms(500);
    range = getDistance();
    sprintf(buf,"Range is %d\r\n",range);
    TxUART(buf);

    nrf_delay_ms(500);
  }

}

void stop_buzzer(void)
{
  NRF_PWM1->TASKS_STOP = 1;
}

void stop_stepping(void)
{
  NRF_PWM0->TASKS_STOP = 1;
}

void uart_init(void)
{
  NRF_UARTE0->BAUDRATE = 0x00275000; //9600bps
  NRF_UARTE0->PSEL.RXD = UART_RX_PIN;
  NRF_UARTE0->PSEL.TXD = UART_TX_PIN;
  NRF_UARTE0->TXD.PTR = sendbuffer;
  NRF_UARTE0->RXD.PTR = recvbuffer;
  NRF_UARTE0->TXD.MAXCNT = 20;
  NRF_UARTE0->RXD.MAXCNT = 20;
  NRF_UARTE0->CONFIG = 0;  //Enable  stop bit, no parity
  NRF_UARTE0->ENABLE = 8;
}

void my_configure(void)
{
  nrf_gpio_cfg_output(DIR_L);
  nrf_gpio_cfg_output(DIR_R);
  nrf_gpio_cfg_output(SLEEP);
  motors_sleep();                 //sleep motors
  nrf_gpio_pin_set(DIR_L);        //set direction forward
  nrf_gpio_pin_clear(DIR_R);
  stepping_mode(1);               //initial mode 1, 1/2 stepping

  nrf_gpio_pin_clear(STEP);
  nrf_gpio_cfg_output(STEP);
  NRF_PWM0->PSEL.OUT[0] = STEP;

  NRF_PWM0->ENABLE = PWM_ENABLE_ENABLE_Enabled;
  NRF_PWM0->MODE = PWM_MODE_UPDOWN_Up;
  NRF_PWM0->PRESCALER = PWM_PRESCALER_PRESCALER_DIV_128;
  NRF_PWM0->LOOP = PWM_LOOP_CNT_Disabled;
  NRF_PWM0->DECODER = (PWM_DECODER_LOAD_Common << PWM_DECODER_LOAD_Pos) | (PWM_DECODER_MODE_RefreshCount << PWM_DECODER_MODE_Pos);
  NRF_PWM0->SEQ[0].REFRESH = 0;
  NRF_PWM0->SEQ[0].ENDDELAY = 0;

  nrf_timer_mode_set(NRF_TIMER1,NRF_TIMER_MODE_TIMER);
  nrf_timer_bit_width_set(NRF_TIMER1,NRF_TIMER_BIT_WIDTH_32);
  nrf_timer_frequency_set(NRF_TIMER1,NRF_TIMER_FREQ_125kHz);
  nrf_timer_int_enable(NRF_TIMER1,1);

#if CB_TEST == 0
  nrf_gpio_pin_clear(BUZZER_10MM);
  nrf_gpio_cfg_output(BUZZER_10MM);
  NRF_PWM1->PSEL.OUT[0] = BUZZER_10MM;

  NRF_PWM1->ENABLE = PWM_ENABLE_ENABLE_Enabled;
  NRF_PWM1->MODE = PWM_MODE_UPDOWN_Up;
  NRF_PWM1->PRESCALER = PWM_PRESCALER_PRESCALER_DIV_128;
  NRF_PWM1->LOOP = PWM_LOOP_CNT_Disabled;
  NRF_PWM1->DECODER = (PWM_DECODER_LOAD_Common << PWM_DECODER_LOAD_Pos) | (PWM_DECODER_MODE_RefreshCount << PWM_DECODER_MODE_Pos);
  NRF_PWM1->SEQ[0].REFRESH = 0;
  NRF_PWM1->SEQ[0].ENDDELAY = 0;
#endif
}

void idle_while_charging(void)
{
    for (;;)
    {
        led_off();
        nrf_delay_ms(500);
        led_on();
        nrf_delay_ms(500);
    }
}

void TxUART(uint8_t* buf)
{
    uint8_t j;

    j=0;
    while(buf[j] != 0)
    {
        sendbuffer[j] = buf[j];
        ++j;
        if (j > 20)
        {
          j = 20;
          break;
        }
    }
    NRF_UARTE0->TXD.MAXCNT = j;
    NRF_UARTE0->TASKS_STARTTX = 1;

    //NRF_UARTE0->RXD.MAXCNT = 1;
    //NRF_UARTE0->TASKS_STARTRX = 1;
    nrf_delay_ms(20);
    while(NRF_UARTE0->EVENTS_ENDTX != 1);
    //while(NRF_UARTE0->EVENTS_ENDRX != 1);
}

